#Введення інформації
print ("Ласкаво просимо до програми аналізу тексту та чисель")
print ("Введіть ваше ім\'я, вік та улюблене число")
#Змінні
your_name=input("Введіть ім\'я: ")
your_age=int(input("Введіть ваш вік: "))
your_number=float(input("Введіть число: "))

#Зміна значень змінних
your_age+=5
your_number*=2

#Виведення інформації
print("Привіт", your_name,"! Радий,що ти використовуєш цю програму")
print("Довжина твого імені: ", len (your_name))
print("Через 5 років тобі буде: ", your_age)
print("Подвоєне улюблене число: ", your_number)

#Перевірка на парність/непарність числа

if your_number % 2 == 0:
    print("Улюблене число є парним.")
else:
    print("Улюблене число є непарним.")

#Завершення програми
print("Дякую за використання програми. Гарного дня,",your_name,"!")
