"""
    Введення користувачем тексту(рядка)
    first_three = text[:3] - виведення перших 3-х символів рядка
    last_three = text[-3:] - виведення останніх 3-х символів рядка
    even_index_chars = text[::2] - виведення символів з парними індексами
    [::2] - перше(початковий елемент), друге(по який елемент рядка), третє(2-крок ітерації рядка)
"""
text = input("Введіть текст: ")
first_three = text[:3]
last_three = text[-3:]
even_index_chars = text[::2]

# Виведення інформації
print(f"Перші 3 символи тексту: {first_three}")
print(f"Останні 3 символи тексту: {last_three}")
print(f"Символи з парними індексами: {even_index_chars}")

"""
    Введення інформації користувачем
    lengh = len(text) - визначення кількості символів в рядку
    Виведення інформації
"""
text = input("Введіть текст: ")
lengh = len(text)
print(f"Кількість символів в рядку: {lengh}")

# Введення інформації користувачем
char = input("Введіть символ: ")
"""
    Цикл визначення Unicode-коду символа
    if len(char) != 1: - перевірка довжини введеного значення користувачем
    print("Введіть тільки 1 символ") -виведення інформації про помилку введення
    char = input("Введіть символ: ") - повторення змінної, щоб користувач знову ввів інф-ю
    continue - продовження роботи програми, поки не буде введено коректне значення

    else: - якщо все введено правильно, проводяться наступні операції
    code = ord(char) - визначення Ucicode-коду введеного символу
"""
while True:
    if len(char) != 1:
        print("Введіть тільки 1 символ")
        char = input("Введіть символ: ")
        continue
    else:
        code = ord(char)
        print(f"Ucicode-код символу {char} - {code}")

    # Виведення інформації і завершення роботи програми
    print(f"Символ з кодом 65: {chr(65)}")
    break

"""
    Цикл форматування рядків

    .capitalize() - дозволяє вводити першу букву ім'я і міста в нижньому реєстрі, але вивід буде в верхньому

    try: - обробка вийнятку
    age = int(input("Введіть вік: ")) - введення користувачем числа(віку)
    except ValueError: - вийняток введення не числа

    if name.isdigit() or city.isdigit(): - перевірка умови,щоб не було цифр
"""
while True:
    # Введення інформації користувачем
    name = input("Введіть ім'я: ").capitalize()
    city = input("Введіть місто: ").capitalize()

    if name.isdigit() or city.isdigit():
        print("Не можна вводити цифри")
        continue

    try:
        age = int(input("Введіть вік: "))
    except ValueError:
        print("Вік має бути числом!")
        continue

    else:
        # Виведення інформації і завершення роботи програми
        print(f"Привіт, мене звати {name}. Мені {age} років. Я з міста {city}")
        break
